# Bases para usar

- [class_datasets](https://github.com/gnlins/class_datasets)

# 0. Instalando e Importando o Pandas

Instalando

In [2]:
#!pip install pandas
#!pip install numpy
#!pip install matplotlib

Importando

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# 1.Abrindo arquivo

Nesse caso, o exemplo será para leitura de csv. Para outros formatos de arquivo consulte a documentação: [Pandas_doc](https://pandas.pydata.org/pandas-docs/stable/reference/io.html)

In [4]:
PATH = "https://raw.githubusercontent.com/gnlins/class_datasets/main/tips/tips.csv"
# df = pd.read_csv(PATH, sep=',', delimiter=';')

df = pd.read_csv(PATH, sep=',')

# 2. Tendo uma visão geral do seu DataFrame

- https://www.linkedin.com/pulse/o-b%25C3%25A1sico-de-manipula%25C3%25A7%25C3%25A3o-dados-em-pandas-parte-i-rog%25C3%25A9rio/?trackingId=JlDzCwYdQQyt1dV%2BNpufQg%3D%3D

- https://www.linkedin.com/pulse/dados-com-pandas-parte-i-rog%25C3%25A9rio-guimar%25C3%25A3es-de-campos-j%25C3%25BAnior/?trackingId=JlDzCwYdQQyt1dV%2BNpufQg%3D%3D

## 2.1 Vendo o inicio e o final do DataFrame

In [5]:
df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
df.tail(10)

     total_bill   tip     sex smoker   day    time  size
234       15.53  3.00    Male    Yes   Sat  Dinner     2
235       10.07  1.25    Male     No   Sat  Dinner     2
236       12.60  1.00    Male    Yes   Sat  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

## 2.2 Vendo Tamanho da base

In [7]:
df.shape # 244 linhas e 7 colunas

(244, 7)

## 2.3 Informações sobre os dados

### Tipos de dados

In [8]:
df.dtypes

total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [10]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

### Selecionando pelo tipo de dado

In [11]:
df.select_dtypes(include='number')

     total_bill   tip  size
0         16.99  1.01     2
1         10.34  1.66     3
2         21.01  3.50     3
3         23.68  3.31     2
4         24.59  3.61     4
..          ...   ...   ...
239       29.03  5.92     3
240       27.18  2.00     2
241       22.67  2.00     2
242       17.82  1.75     2
243       18.78  3.00     2

[244 rows x 3 columns]

In [12]:
df.select_dtypes(include='object')

        sex smoker   day    time
0    Female     No   Sun  Dinner
1      Male     No   Sun  Dinner
2      Male     No   Sun  Dinner
3      Male     No   Sun  Dinner
4    Female     No   Sun  Dinner
..      ...    ...   ...     ...
239    Male     No   Sat  Dinner
240  Female    Yes   Sat  Dinner
241    Male    Yes   Sat  Dinner
242    Male     No   Sat  Dinner
243  Female     No  Thur  Dinner

[244 rows x 4 columns]

## 2.4 Operações de Colunas

In [13]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [14]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [15]:
df[['total_bill','tip']]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

### Coletando Valores Unicos

In [16]:
df['time'].unique()

array(['Dinner', 'Lunch'], dtype=object)

In [17]:
df['time'].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [18]:
#Calculo Percentual

## 2.5 Operações de Linhas

### Filtrando Valores

In [19]:
df.loc[2, ['total_bill','tip']]

total_bill    21.01
tip             3.5
Name: 2, dtype: object

In [20]:
df.loc[df['total_bill']>=15]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[164 rows x 7 columns]

In [21]:
df[df['total_bill']>=15]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[164 rows x 7 columns]

In [22]:
df.iloc[:4,0:3]

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male

## 2.6 Agregação

In [23]:
df['total_bill'].mean()

19.78594262295082

In [24]:
df['total_bill'].sum()

4827.77

In [25]:
df['tip'].max()

10.0

In [26]:
df['tip'].min()

1.0

In [27]:
df.groupby('time').max()

        total_bill   tip   sex smoker   day  size
time
Dinner       50.81  10.0  Male    Yes  Thur     6
Lunch        43.11   6.7  Male    Yes  Thur     6

In [28]:
df.groupby('time')[['total_bill','tip']].max()

        total_bill   tip
time
Dinner       50.81  10.0
Lunch        43.11   6.7

In [29]:
df.groupby('time').agg({'total_bill':'mean', 'tip':'max'})

        total_bill   tip
time
Dinner   20.797159  10.0
Lunch    17.168676   6.7

## 2.7 Conversao de dados

In [30]:
df.astype({'tip': 'int'})

     total_bill  tip     sex smoker   day    time  size
0         16.99    1  Female     No   Sun  Dinner     2
1         10.34    1    Male     No   Sun  Dinner     3
2         21.01    3    Male     No   Sun  Dinner     3
3         23.68    3    Male     No   Sun  Dinner     2
4         24.59    3  Female     No   Sun  Dinner     4
..          ...  ...     ...    ...   ...     ...   ...
239       29.03    5    Male     No   Sat  Dinner     3
240       27.18    2  Female    Yes   Sat  Dinner     2
241       22.67    2    Male    Yes   Sat  Dinner     2
242       17.82    1    Male     No   Sat  Dinner     2
243       18.78    3  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [31]:
df.dtypes

total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [32]:
df.astype({'tip': 'int'}).dtypes

total_bill    float64
tip             int32
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

### Lidando com Data

In [33]:
#df.Date = pd.to_datetime(df.Date, format="%Y-%m-%d")

In [34]:
# df["Year"] = df.Date.dt.year

## 2.8 Juntando tabelas

In [35]:
df.day.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [38]:
dim_day = pd.read_csv('day_number.csv',sep=';')

In [39]:
df.merge(dim_day, on='day', how='left')

     total_bill   tip     sex smoker   day    time  size  number
0         16.99  1.01  Female     No   Sun  Dinner     2       1
1         10.34  1.66    Male     No   Sun  Dinner     3       1
2         21.01  3.50    Male     No   Sun  Dinner     3       1
3         23.68  3.31    Male     No   Sun  Dinner     2       1
4         24.59  3.61  Female     No   Sun  Dinner     4       1
..          ...   ...     ...    ...   ...     ...   ...     ...
239       29.03  5.92    Male     No   Sat  Dinner     3       7
240       27.18  2.00  Female    Yes   Sat  Dinner     2       7
241       22.67  2.00    Male    Yes   Sat  Dinner     2       7
242       17.82  1.75    Male     No   Sat  Dinner     2       7
243       18.78  3.00  Female     No  Thur  Dinner     2       5

[244 rows x 8 columns]

## 2.9 Salvando

In [36]:
df.to_csv("gorjetas_salvas.csv", sep=';')